{
    "university_name": "Universiteit van Amsterdam",
    "university_code": "UVA",
    "courses": [
        {
            "title": "Moleculaire genetica",
            "description": "Leer chemische basisprincipes, watereigenschappen, biomoleculen, en zuur/base reacties voor biologen.",
            "lectures": [
                {
                    "title": "1_Embryonale_ontwikkeling",
                    "description": "De ontwikkeling van een embryo van bevruchting tot geboorte en de invloed van externe factoren."
                },
                {
                    "title": "2_Signaaltransductie",
                    "description": "De processen en mechanismen die betrokken zijn bij het doorgeven van signalen binnen en tussen cellen."
                },
                {
                    "title": "3_Eiwittransport",
                    "description": "De processen en mechanismen die betrokken zijn bij het transport van eiwitten binnen cellen en tussen cellen."
                },
                {
                    "title": "4_Structuur_en_functie_van_DNA",
                    "description": "Behandelt de chemische en fysieke eigenschappen van DNA, de dubbele helix, en de organisatie van erfelijk materiaal."
                },
                {
                    "title": "5_DNA_replicatie_en_reparatie",
                    "description": "Gaat in op de mechanismen van DNA-replicatie, DNA-schade, en de reparatiesystemen die genetische integriteit handhaven."
                },
                {
                    "title": "6_Mutatie_en_transpositie",
                    "description": "Bestudeert de oorzaken en gevolgen van mutaties en de rol van transposons in genoomdiversiteit."
                },
                {
                    "title": "7_Transcriptie_en_translatie",
                    "description": "Richt zich op de processen waarbij DNA wordt omgezet in RNA (transcriptie) en RNA in eiwit (translatie)."
                },
                {
                    "title": "8_Regulatie_van_genexpressie",
                    "description": "Onderzoekt hoe genexpressie wordt gereguleerd in prokaryoten en eukaryoten, inclusief epigenetische controlemechanismen."
                }
            ]
        },
        {
            "title": "Chemie van het leven",
            "description": "Leer structuur van erfelijk materiaal, DNA-replicatie, mutaties, en genetische modificatie.",
            "lectures": [
                {
                    "title": "1_Embryonale_ontwikkeling",
                    "description": "De ontwikkeling van een embryo van bevruchting tot geboorte en de invloed van externe factoren."
                }
            ]
        }
    ]
}